na6an/Wifi-BT/bleapp.cydsn/Generated_Source/PSoC6/capsense_Structure.h
/* Bit 12: 5x5 centroid Enable/Disable. */
#define capsense_CENTROID_5X5_SIZE        (0x00000001Lu)
#define capsense_CENTROID_5X5_SHIFT       (12u)
#define capsense_CENTROID_5X5_MASK        (capsense_CENTROID_5X5_SIZE << capsense_CENTROID_5X5_SHIFT)

/* Bit 13: Edge correction Enable/Disable. */
#define capsense_EDGE_CORRECTION_SIZE     (0x00000001Lu)
#define capsense_EDGE_CORRECTION_SHIFT    (13u)
#define capsense_EDGE_CORRECTION_MASK     (capsense_EDGE_CORRECTION_SIZE << capsense_EDGE_CORRECTION_SHIFT)

/* Bit 14: Two finger detection Enable/Disable. */
#define capsense_TWO_FINGER_DETECTION_SIZE (0x00000001Lu)
#define capsense_TWO_FINGER_DETECTION_SHIFT (14u)
#define capsense_TWO_FINGER_DETECTION_MASK (capsense_TWO_FINGER_DETECTION_SIZE << capsense_TWO_FINGER_DETECTION_SHIFT)


/*******************************************************************************
* Defines Data Structure Macro helpers
*******************************************************************************/

/*******************************************************************************
* Determines the widget specific word in the wdgtStatus array by widget ID
*******************************************************************************/
/* Divide by 32 - size of the wdgtStatus word in bits to find the word index */
#define capsense_GET_WDGT_STATUS_INDEX(wdgtId)  ((wdgtId) >> 5u)

/*******************************************************************************
* Determines the widget bitmask in wdgtStatus word by widget ID
*******************************************************************************/
/* Take the least 5 bits of widget id to find the bit number */
#define capsense_GET_WDGT_STATUS_MASK(wdgtId)   (1Lu << ((wdgtId) & 0x1FLu))

/*******************************************************************************
* Determines the sense method of the widget
*******************************************************************************/
#if (0u != capsense_TOTAL_CSD_WIDGETS) && (0u != capsense_TOTAL_CSX_WIDGETS)
    #define capsense_GET_SENSE_METHOD(ptrFlash) ((capsense_SENSE_METHOD_ENUM)(ptrFlash)->senseMethod)
#else
    #if (0u != capsense_TOTAL_CSX_WIDGETS)
        #define capsense_GET_SENSE_METHOD(ptrFlash) capsense_SENSE_METHOD_CSX_E
    #else
        #define capsense_GET_SENSE_METHOD(ptrFlash) capsense_SENSE_METHOD_CSD_E
    #endif /* #if (0u != capsense_TOTAL_CSX_WIDGETS) */
#endif /* #if (0u != capsense_TOTAL_CSD_WIDGETS) && (0u != capsense_TOTAL_CSX_WIDGETS) */

/*******************************************************************************
* Gets the widget type
*******************************************************************************/
#define capsense_GET_WIDGET_TYPE(ptrFlashWdgt)  ((capsense_WD_TYPE_ENUM)((ptrFlashWdgt)->wdgtType))

/*******************************************************************************
* Gets the number of the widget's sensors
*******************************************************************************/
#define capsense_GET_SENSOR_COUNT(widgetId)         capsense_dsFlash.wdgtArray[(widgetId)].totalNumSns
#define capsense_GET_SNS_CNT_BY_PTR(ptrFlashWidget) (ptrFlashWidget)->totalNumSns

/*******************************************************************************
* Increments the pointer to the Regular Filter History Object
*******************************************************************************/
#if (0u != capsense_REGULAR_RC_ALP_FILTER_EN)
    #define capsense_INC_REG_FLTR_OBJ(fltrVariant)      \
        do {                                                    \
            (fltrVariant).ptrAlp++;                             \
        } while(0)
#elif (0u != capsense_REGULAR_RC_FILTER_EN)
    #define capsense_INC_REG_FLTR_OBJ(fltrVariant)      \
        do {                                                    \
            (fltrVariant).ptrRegular++;                         \
        } while(0)
#else
    #define capsense_INC_REG_FLTR_OBJ(fltrVariant)      \
        do {                                                    \
        } while(0)
#endif

/*******************************************************************************
* Increments the pointer to the Proximity Filter History Object
*******************************************************************************/
#if (0u != capsense_PROX_RC_ALP_FILTER_EN)
    #define capsense_INC_PROX_FLTR_OBJ(fltrVariant)     \
        do {                                                    \
            (fltrVariant).ptrAlp++;                             \
        } while(0)
#elif (0u != capsense_PROX_RC_FILTER_EN)
    #define capsense_INC_PROX_FLTR_OBJ(fltrVariant)     \
        do {                                                    \
            (fltrVariant).ptrProx++;                            \
        } while(0)
#else
    #define capsense_INC_PROX_FLTR_OBJ(fltrVariant)     \
        do {                                                    \
        } while(0)
#endif

/*******************************************************************************
* Increments the pointer to the Filter History Object Variant
*******************************************************************************/
#define capsense_INC_FLTR_OBJ_VARIANT(isProxHistObj, fltrVariant)   \
    do {                                                                    \
        if (0u == (isProxHistObj))                                          \
        {                                                                   \
            capsense_INC_REG_FLTR_OBJ(fltrVariant);                 \
        }                                                                   \
        else                                                                \
        {                                                                   \
            capsense_INC_PROX_FLTR_OBJ(fltrVariant);                \
        }                                                                   \
    } while(0)

/*******************************************************************************
* Gets a widget status in the global enable register dsRam.wdgtEnable[]
*******************************************************************************/
#if (capsense_ENABLE == capsense_SELF_TEST_EN)
    #define capsense_GET_WIDGET_EN_STATUS(wdId)                                                     \
                 (capsense_GET_WDGT_STATUS_MASK(wdId) &                                             \
                  capsense_dsRam.wdgtEnable[capsense_GET_WDGT_STATUS_INDEX(wdId)] &         \
                  capsense_dsRam.wdgtWorking[capsense_GET_WDGT_STATUS_INDEX(wdId)])
#else
    #define capsense_GET_WIDGET_EN_STATUS(wdId)                    \
                (capsense_GET_WDGT_STATUS_MASK(wdId) &             \
                 capsense_dsRam.wdgtEnable[capsense_GET_WDGT_STATUS_INDEX(wdId)])
#endif /* (capsense_ENABLE == capsense_SELF_TEST_EN) */

