na6an/Wifi-BT/bleapp.cydsn/Generated_Source/PSoC6/capsense_Structure.h
/*******************************************************************************
* Gets a widget active status from the dsRam.wdgtStatus[] register
*******************************************************************************/
#define capsense_GET_WIDGET_ACTIVE_STATUS(wdId)                    \
            (capsense_GET_WDGT_STATUS_MASK(wdId) &                 \
             capsense_dsRam.wdgtStatus[capsense_GET_WDGT_STATUS_INDEX(wdId)])

/*******************************************************************************
* Declares Flash and RAM Data Structure variables
*******************************************************************************/
extern capsense_RAM_STRUCT            capsense_dsRam;
extern const capsense_FLASH_STRUCT    capsense_dsFlash;
extern const capsense_FLASH_IO_STRUCT capsense_ioList[capsense_TOTAL_ELECTRODES];
extern const capsense_RAM_WD_LIST_STRUCT capsense_ramWidgetInit;
extern const uint8 capsense_ramIdacInit[capsense_TOTAL_SENSORS];






/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/*******************************************************************************
* High-level API
*******************************************************************************/

/**
* \cond SECTION_CYSENSE_HIGH_LEVEL
* \addtogroup group_cysense_high_level
* \{
*/

uint32 capsense_IsAnyWidgetActive(void);
uint32 capsense_IsWidgetActive(uint32 widgetId);
uint32 capsense_IsSensorActive(uint32 widgetId, uint32 sensorId);

#if (0u != capsense_MATRIX_WIDGET_EN)
    uint32 capsense_IsMatrixButtonsActive(uint32 widgetId);
#endif /* #if (0u != capsense_MATRIX_WIDGET_EN) */

#if (0u != capsense_PROXIMITY_WIDGET_EN)
    uint32 capsense_IsProximitySensorActive(uint32 widgetId, uint32 proxId);
#endif /* #if (0u != capsense_PROXIMITY_WIDGET_EN) */

#if (0u != capsense_SLIDER_WIDGET_EN)
    uint32 capsense_GetCentroidPos(uint32 widgetId);
#endif /* #if (0u != capsense_SLIDER_WIDGET_EN) */

#if (0u != capsense_TOUCHPAD_WIDGET_EN)
    uint32 capsense_GetXYCoordinates(uint32 widgetId);
#endif /* #if (0u != capsense_TOUCHPAD_WIDGET_EN) */

/** \}
* \endcond */

/*******************************************************************************
* Low level API
*******************************************************************************/

/**
* \cond SECTION_CYSENSE_LOW_LEVEL
* \addtogroup group_cysense_low_level
* \{
*/

cy_status capsense_GetParam(uint32 paramId, uint32 *value);
cy_status capsense_SetParam(uint32 paramId, uint32 value);

/** \}
* \endcond */

/*******************************************************************************
* Function Prototypes - internal functions
*******************************************************************************/
/**
* \cond SECTION_CYSENSE_INTERNAL
* \addtogroup group_cysense_internal
* \{
*/



void capsense_DsInitialize(void);
#if (0u != capsense_ADC_EN)
    void capsense_AdcDsInitialize(void);
#endif /* (0u != capsense_ADC_EN) */

/** \}
* \endcond */

#endif /* End CY_SENSE_capsense_STRUCTURE_H */

/* [] END OF FILE */
